// #Jg0gPO00
// створити конвертор ваги з кг в фунти. дані заповнюються через інпут. При введенні даних обрахунок стається миттєво, без натискань додаткових кнопок

let input = document.forms['cnv']['converterPounds'];
let div = document.createElement('div');
input.oninput = function (){
div.innerText = +input.value * 2.2046;
document.body.appendChild(div);
    console.log(div);
}
// у цій стрічці коду -  div.innerText = +input.value * 2.2046; відбувається підсвічування помилки Assigned expression type number is not assignable to type string(Присвоєний номер типу виразу не може бути присвоєний типу string). Але при цьому конвертор працює вірно. Якщо ж прописати так: div.innerText = str(+input.value * 2.2046); то вже підсвічуватись помилка не буде, але конвертор не буде працювати. То виходить що правильне вирішення цього завдання — це залишити цю підсвічену у коді помилку(при варіанті розв’язку div.innerText = +input.value * 2.2046;)? У відеорозв’язку цього завдання я також побачив що ця помилка підсвічується, а у конверторі виводиться уже стрінга(бо чорним кольором), тобто все-таки конвертація у стрінгу відбулася автоматично. ПИТАННЯ: то чому ж програма сварилася на цей момент, якщо потім відбувається автоматична конвертація у тип string?